InformationRegisters/ИтогоПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИтогоПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИтогоПроекта/Ext/ManagerModule.bsl
&НаСервере
Функция ОстаткиПоДоговору(Сделка, НомерПоПорядку = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИтогоПроекта.ИзделияЗаказчика КАК ИзделияЗаказчика,
	|	СУММА(ИтогоПроекта.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.ИтогоПроекта КАК ИтогоПроекта
	|ГДЕ
	|	ИтогоПроекта.Проект = &Проект
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогоПроекта.ИзделияЗаказчика";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Если НомерПоПорядку = Неопределено Тогда
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	тзТекущиеОстатки =  Запрос.Выполнить().Выгрузить();
	
	тзВозврата = тзТекущиеОстатки.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтогоПроекта.ИзделияЗаказчика КАК ИзделияЗаказчика,
		|	СУММА(ИтогоПроекта.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ИтогоПроекта КАК ИтогоПроекта
		|ГДЕ
		|	ИтогоПроекта.Проект = &Проект
		|	И ИтогоПроекта.Договор.НомерПоПорядку < &НомерПоПорядку
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогоПроекта.ИзделияЗаказчика";
	
	Запрос.УстановитьПараметр("НомерПоПорядку", НомерПоПорядку);
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзТекущиеОстатки.Найти(Выборка.ИзделияЗаказчика,"ИзделияЗаказчика");
		
		Если НайденаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		текКоличестао = Мин(Выборка.Количество, НайденаяСтрока.Количество);
		
		Если текКоличестао = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НС = тзВозврата.Добавить();
		НС.ИзделияЗаказчика = НайденаяСтрока.ИзделияЗаказчика;
		НС.Количество 		= текКоличестао;
	КонецЦикла;
	
    Возврат тзВозврата;
КонецФункции // ОстаткиПоДоговору()
